## 讀取591 房屋數據

In [1]:
import pandas as pd
link = 'https://raw.githubusercontent.com/ywchiu/cathaylifepy/master/data/rent591.xlsx' 
df = pd.read_excel(link, index_col=0)
df.head()

,address,floor,allfloor,layout,area,price,browsenum_all,created_date
0,復興南路160巷精華地段雙..,2,15,2房1廳1衛,28.0,"43,800",2180,2019/06/05
1,"臥龍街前眺101後擁山景,..",11,12,3房2廳2衛,69.0,"120,000",1722,2019/06/05
2,光復南路高樓層大巨蛋正對..,10,13,4房2廳2衛,71.3,"130,000",3272,2016/12/14
3,信義路三段台北大安森林公..,12,14,1房2廳1衛,11.0,"36,000",4890,2019/02/26
4,和平東路一段和平大..,4,11,2房2廳1衛,16.0,"30,000",4900,2019/06/04

In [4]:
(df['area'] / 0.3025).head()

0     92.561983
1    228.099174
2    235.702479
3     36.363636
4     52.892562
Name: area, dtype: float64

In [6]:
import numpy as np
np.sqrt(df['area']).head()

0    5.291503
1    8.306624
2    8.443933
3    3.316625
4    4.000000
Name: area, dtype: float64

In [10]:
(df['address'] + '-' +df['price'] ).head()

0     復興南路160巷精華地段雙..-43,800
1    臥龍街前眺101後擁山景,..-120,000
2     光復南路高樓層大巨蛋正對..-130,000
3      信義路三段台北大安森林公..-36,000
4         和平東路一段和平大..-30,000
dtype: object

In [11]:
df['square_feet'] = df['area'] / 0.3025

In [12]:
df.head()

,address,floor,allfloor,layout,area,price,browsenum_all,created_date,square_feet
0,復興南路160巷精華地段雙..,2,15,2房1廳1衛,28.0,"43,800",2180,2019/06/05,92.561983
1,"臥龍街前眺101後擁山景,..",11,12,3房2廳2衛,69.0,"120,000",1722,2019/06/05,228.099174
2,光復南路高樓層大巨蛋正對..,10,13,4房2廳2衛,71.3,"130,000",3272,2016/12/14,235.702479
3,信義路三段台北大安森林公..,12,14,1房2廳1衛,11.0,"36,000",4890,2019/02/26,36.363636
4,和平東路一段和平大..,4,11,2房2廳1衛,16.0,"30,000",4900,2019/06/04,52.892562

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 772 entries, 0 to 21
Data columns (total 9 columns):
address          772 non-null object
floor            772 non-null int64
allfloor         772 non-null int64
layout           772 non-null object
area             772 non-null float64
price            772 non-null object
browsenum_all    772 non-null int64
created_date     767 non-null object
square_feet      772 non-null float64
dtypes: float64(2), int64(3), object(4)
memory usage: 60.3+ KB

In [15]:
df['price'].dtypes

dtype('O')

In [18]:
s = '43,800'
int(s.replace(',',''))

43800

In [19]:
def normalizePrice(ele):
    res = int(ele.replace(',', ''))
    return res

normalizePrice(s)

43800

In [21]:
df['price'].map(normalizePrice).head()

0     43800
1    120000
2    130000
3     36000
4     30000
Name: price, dtype: int64

In [22]:
def normalizePrice(ele):
    res = int(ele.replace(',', ''))
    return res

normalizePrice2 = lambda ele: int(ele.replace(',', ''))

In [23]:
df['price'].map(normalizePrice2).head()

0     43800
1    120000
2    130000
3     36000
4     30000
Name: price, dtype: int64

In [24]:
df['price'].map(lambda ele: int(ele.replace(',', ''))).head()

0     43800
1    120000
2    130000
3     36000
4     30000
Name: price, dtype: int64

In [36]:
df['price'] = df['price'].map(lambda ele: int(ele.replace(',', '')))

In [37]:
df.head()

,address,floor,allfloor,layout,area,price,browsenum_all,created_date,square_feet
0,復興南路160巷精華地段雙..,2,15,2房1廳1衛,28.0,43800,2180,2019/06/05,92.561983
1,"臥龍街前眺101後擁山景,..",11,12,3房2廳2衛,69.0,120000,1722,2019/06/05,228.099174
2,光復南路高樓層大巨蛋正對..,10,13,4房2廳2衛,71.3,130000,3272,2016/12/14,235.702479
3,信義路三段台北大安森林公..,12,14,1房2廳1衛,11.0,36000,4890,2019/02/26,36.363636
4,和平東路一段和平大..,4,11,2房2廳1衛,16.0,30000,4900,2019/06/04,52.892562

In [34]:
s = pd.Series([0, 1, 2, 3, 4])
s.replace(0, 5)

0    5
1    1
2    2
3    3
4    4
dtype: int64

In [38]:
df2 = pd.DataFrame(\
 [\
    [60,70,50],\
    [80,79,68],\
    [63,66,82]], \
columns = ['First', 'Second', 'Third'])
df2

   First  Second  Third
0     60      70     50
1     80      79     68
2     63      66     82

In [39]:
df2.apply(lambda e: e.max() - e.min(), axis = 0)

First     20
Second    13
Third     32
dtype: int64

In [40]:
df2.apply(lambda e: e.max() - e.min(), axis = 1)

0    20
1    12
2    19
dtype: int64

In [42]:
df2.applymap(lambda e: '$'+str(e))

  First Second Third
0   $60    $70   $50
1   $80    $79   $68
2   $63    $66   $82

## 時間格式資料
- https://docs.python.org/3/library/datetime.html#strftime-and-strptime-behavior

In [43]:
a = '2019-07-09'
b = '2019-01-01'
a - b

TypeError: unsupported operand type(s) for -: 'str' and 'str'

In [47]:
from datetime import datetime
current_time = datetime.now()

In [48]:
current_time.strftime('%Y-%m-%d')

'2019-07-09'

In [51]:
boy = datetime.strptime('2019-01-01','%Y-%m-%d')
boy

datetime.datetime(2019, 1, 1, 0, 0)

In [52]:
current_time - boy

datetime.timedelta(189, 36034, 918176)

In [54]:
(current_time - boy).days

189

In [55]:
from datetime import timedelta
current_time - timedelta(days = 1)

datetime.datetime(2019, 7, 8, 10, 0, 34, 918176)

In [56]:
current_time - timedelta(days = 10)

datetime.datetime(2019, 6, 29, 10, 0, 34, 918176)

In [57]:
current_time + timedelta(days = 10)

datetime.datetime(2019, 7, 19, 10, 0, 34, 918176)

In [58]:
for i in range(10):
    dt = current_time - timedelta(days = i)
    print(dt.strftime('%Y/%m/%d'))

2019/07/09
2019/07/08
2019/07/07
2019/07/06
2019/07/05
2019/07/04
2019/07/03
2019/07/02
2019/07/01
2019/06/30

In [59]:
from time import mktime 
mktime(current_time.timetuple())

1562637634.0

In [60]:
datetime.fromtimestamp(1555860118)

datetime.datetime(2019, 4, 21, 23, 21, 58)

In [62]:
df.head()

,address,floor,allfloor,layout,area,price,browsenum_all,created_date,square_feet
0,復興南路160巷精華地段雙..,2,15,2房1廳1衛,28.0,43800,2180,2019/06/05,92.561983
1,"臥龍街前眺101後擁山景,..",11,12,3房2廳2衛,69.0,120000,1722,2019/06/05,228.099174
2,光復南路高樓層大巨蛋正對..,10,13,4房2廳2衛,71.3,130000,3272,2016/12/14,235.702479
3,信義路三段台北大安森林公..,12,14,1房2廳1衛,11.0,36000,4890,2019/02/26,36.363636
4,和平東路一段和平大..,4,11,2房2廳1衛,16.0,30000,4900,2019/06/04,52.892562

In [64]:
df['created_date'] = pd.to_datetime(df['created_date'], format = '%Y/%m/%d')

In [66]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 772 entries, 0 to 21
Data columns (total 9 columns):
address          772 non-null object
floor            772 non-null int64
allfloor         772 non-null int64
layout           772 non-null object
area             772 non-null float64
price            772 non-null int64
browsenum_all    772 non-null int64
created_date     767 non-null datetime64[ns]
square_feet      772 non-null float64
dtypes: datetime64[ns](1), float64(2), int64(4), object(2)
memory usage: 60.3+ KB

In [69]:
df[df['created_date'] > '2019-01-01'].head()

,address,floor,allfloor,layout,area,price,browsenum_all,created_date,square_feet
0,復興南路160巷精華地段雙..,2,15,2房1廳1衛,28.0,43800,2180,2019-06-05,92.561983
1,"臥龍街前眺101後擁山景,..",11,12,3房2廳2衛,69.0,120000,1722,2019-06-05,228.099174
3,信義路三段台北大安森林公..,12,14,1房2廳1衛,11.0,36000,4890,2019-02-26,36.363636
4,和平東路一段和平大..,4,11,2房2廳1衛,16.0,30000,4900,2019-06-04,52.892562
5,和平東路二段師大商..,2,4,2房1廳1衛,23.0,23009,9627,2019-06-13,76.033058

In [70]:
b = '2019-12-31'
a = '2019-01-01'

db = datetime.strptime(b,'%Y-%m-%d')
da = datetime.strptime(a,'%Y-%m-%d')

In [72]:
ary = []
for i in range(365):
    dt = da + timedelta(i)
    ary.append(dt)
s = pd.Series(ary)

In [82]:
#s.dt.month
#s.dt.week
df3 = pd.concat([s, s.dt.weekday, s.dt.week, s.dt.month], axis = 1)

In [84]:
df3.columns = ['date', 'weekday', 'week', 'month']

In [96]:
# 挑出星期五
df3  = df3[df3['weekday'] == 4]

#把每個月的最後一週列出來
c = df3.groupby('month')['week'].transform(max)
c.head()

3     4
10    4
17    4
24    4
31    8
Name: week, dtype: int64

In [98]:
#把每個月的最後一週星期五列出來
df3[df3['week'] == c].head()

          date  weekday  week  month
24  2019-01-25        4     4      1
52  2019-02-22        4     8      2
87  2019-03-29        4    13      3
115 2019-04-26        4    17      4
150 2019-05-31        4    22      5

## 正規表達法

In [99]:
s = 'i am david, here is my phone number: 0912345678'
'0912345678' in s

True

In [100]:
s2 = 'i am hubert, here is my phone number: 0922335678'
'0912345678' in s2

False

In [101]:
import re

In [102]:
n = '3'

In [103]:
re.match('3', n)

In [104]:
re.match('5', n)

In [105]:
# []: match any charater within []
re.match('[0123456789]', n)

In [106]:
# -: continuous
# [0123456789] => [0-9]
re.match('[0-9]', n)

In [107]:
# \d => [0-9]
re.match('\d', n)

In [108]:
s = 'w'
re.match('[abcdefghijklmnopqrstuvwxyz]', s)

In [109]:
re.match('[a-z]', s)

In [110]:
re.match('[a-z]', n)

In [111]:
re.match('[a-z0-9]', n)

In [112]:
s  = 'W'
re.match('[a-z0-9]', s)

In [113]:
re.match('[a-zA-Z0-9]', s)

In [114]:
# \w => [a-zA-Z0-9]
re.match('\w', s)

In [115]:
s = '$'
re.match('\w', s)

In [116]:
# .: match any charater
re.match('.', s)

In [117]:
s = 'apple'
re.match('\w', s)

In [118]:
re.match('\w\w\w\w\w', s)

In [119]:
# {m} : match exact m charaters
re.match('\w{5}', s)

In [120]:
s = 'appledaily'
re.match('\w{5}', s)

In [121]:
# {m,n} : match at least m charaters, at most n charaters
re.match('\w{5,10}', s)

In [122]:
# {m,} : match at least m charaters
re.match('\w{5,}', s)

In [123]:
re.match('\w{1,}', s)

In [124]:
# + => {1,}
re.match('\w+', s)

In [125]:
# * => {0,}
re.match('\w*', s)

In [130]:
phones = ['0912345678','0912-345678','0912-345-678', '09123453748748924789324798247928492']
for p in phones:
    #m = re.match('09\d{8}', p)
    #m = re.match('09\d{2}-{0,1}\d{3}-{0,1}\d{3}', p)
    
    # ? => {0,1}
    #m = re.match('09\d{2}-?\d{3}-?\d{3}', p)
    
    # ^ : match begin, $ match end
    m = re.match('^09\d{2}-?\d{3}-?\d{3}$', p)
    print(m)

<_sre.SRE_Match object; span=(0, 10), match='0912345678'>
<_sre.SRE_Match object; span=(0, 11), match='0912-345678'>
<_sre.SRE_Match object; span=(0, 12), match='0912-345-678'>
None

In [134]:
#df['layout'].map(lambda e: e.split('房')[0])

In [137]:
df['layout'].str.extract('(\d+)房(\d+)廳(\d+)衛').head()

   0  1  2
0  2  1  1
1  3  2  2
2  4  2  2
3  1  2  1
4  2  2  1

In [138]:
df[['layout_bedroom', 'layout_livingroom', 'layout_bathroom']] = df['layout'].str.extract('(\d+)房(\d+)廳(\d+)衛')

In [148]:
df['address'].head()

0    復興南路160巷精華地段雙..
1    臥龍街前眺101後擁山景,..
2     光復南路高樓層大巨蛋正對..
3     信義路三段台北大安森林公..
4        和平東路一段和平大..
Name: address, dtype: object

In [145]:
df['road'] = df['address'].str.extract('(.+?[路街]).+')

In [147]:
df['road'].value_counts()

忠孝東路    95
仁愛路     79
信義路     77
和平東路    58
光復南路    58
復興南路    46
敦化南路    45
羅斯福路    41
安和路     37
大安路     29
建國南路    28
瑞安街     25
永康街     14
臥龍街     12
新生南路    12
通化街     10
泰順街     10
四維路      9
辛亥路      9
延吉街      9
基隆路      8
樂利路      8
杭州南路     5
師大路      4
浦城街      4
通安街      3
麗水街      3
金華街      2
樂業街      2
文昌街      2
潮州街      2
安東街      1
嘉興街      1
吳興街      1
青田街      1
濟南路      1
Name: road, dtype: int64

## Pandas Aggregation

In [153]:
# SELECT created_date, AVG(price) FROM df GROUP BY created_date
df.groupby('created_date')['price'].mean().head()

created_date
2010-01-01     40000.0
2010-07-08     35000.0
2010-10-08    150000.0
2010-12-06     35000.0
2011-11-27     20000.0
Name: price, dtype: float64

In [156]:
# SELECT created_date, road, AVG(price) FROM df GROUP BY created_date, road
df.groupby(['created_date', 'road'])['price'].mean().head()

created_date  road
2010-01-01    通化街      40000.0
2010-07-08    安和路      35000.0
2010-10-08    光復南路    150000.0
2010-12-06    光復南路     35000.0
2011-11-27    瑞安街      20000.0
Name: price, dtype: float64

In [158]:
df.groupby('created_date')['price'].sum().head()

created_date
2010-01-01     40000
2010-07-08     35000
2010-10-08    150000
2010-12-06     35000
2011-11-27     20000
Name: price, dtype: int64

In [159]:
df.groupby('created_date')['price'].mean().head()

created_date
2010-01-01     40000.0
2010-07-08     35000.0
2010-10-08    150000.0
2010-12-06     35000.0
2011-11-27     20000.0
Name: price, dtype: float64

In [160]:
df.groupby('created_date')['price'].std().head()

created_date
2010-01-01   NaN
2010-07-08   NaN
2010-10-08   NaN
2010-12-06   NaN
2011-11-27   NaN
Name: price, dtype: float64

In [166]:
# SELECT created_date, AVG(price) FROM df 
# GROUP BY created_date ORDER BY AVG(price) DESC
df.groupby('created_date')['price'].mean().sort_values(ascending = False).head()

created_date
2018-08-30    280000.0
2019-01-26    260000.0
2018-08-18    249999.0
2018-11-13    220000.0
2019-01-17    200000.0
Name: price, dtype: float64

In [170]:
df.sort_values('price', ascending=False).head()

,address,floor,allfloor,layout,area,price,browsenum_all,created_date,square_feet,layout_bedroom,layout_livingroom,layout_bathroom,road
26,仁愛路三段成交多戶帝寶找我看..,8,18,5房2廳4衛,210.7,350000,201,2019-05-16,696.528926,5,2,4,仁愛路
25,瑞安街81巷瑞安豪宅❂裝潢、家..,2,13,4房2廳3衛,112.6,280000,262,2018-08-30,372.231405,4,2,3,瑞安街
28,瑞安街81巷大陽台全新裝潢近森..,2,13,4房2廳4衛,112.6,280000,65,2019-06-03,372.231405,4,2,4,瑞安街
13,敦化南路二段華麗裝潢、敦化南..,21,21,6房4廳5衛,89.0,260000,79,2019-06-04,294.214876,6,4,5,敦化南路
15,敦化南路二段★貴族豪邸★霸氣..,21,21,6房4廳5衛,89.2,260000,103,2019-05-29,294.876033,6,4,5,敦化南路

## Data Reshape

In [173]:
pd.get_dummies(df['road']).head(3)

,仁愛路,信義路,光復南路,吳興街,和平東路,嘉興街,四維路,基隆路,大安路,安和路,...,濟南路,瑞安街,羅斯福路,臥龍街,辛亥路,通化街,通安街,金華街,青田街,麗水街
0,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,0,0,0,0,0,0,0,0,0,0,...,0,0,0,1,0,0,0,0,0,0
2,0,0,1,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [177]:
roads = pd.get_dummies(df['road'])
#roads.head(3)
df2 = pd.concat([df, roads], axis = 1)

In [180]:
# del df2['road']
# df2.drop('road', axis = 1)

In [183]:
df2 = pd.pivot_table(df, index='created_date', columns='road', values='price', aggfunc=sum)

In [184]:
df2 = pd.pivot_table(df, index='road', columns='created_date', values='price', aggfunc=sum)

In [188]:
df['year'] = df['created_date'].dt.year
df['month'] = df['created_date'].dt.month

In [189]:
df.head()

,address,floor,allfloor,layout,area,price,browsenum_all,created_date,square_feet,layout_bedroom,layout_livingroom,layout_bathroom,road,year,month
0,復興南路160巷精華地段雙..,2,15,2房1廳1衛,28.0,43800,2180,2019-06-05,92.561983,2,1,1,復興南路,2019.0,6.0
1,"臥龍街前眺101後擁山景,..",11,12,3房2廳2衛,69.0,120000,1722,2019-06-05,228.099174,3,2,2,臥龍街,2019.0,6.0
2,光復南路高樓層大巨蛋正對..,10,13,4房2廳2衛,71.3,130000,3272,2016-12-14,235.702479,4,2,2,光復南路,2016.0,12.0
3,信義路三段台北大安森林公..,12,14,1房2廳1衛,11.0,36000,4890,2019-02-26,36.363636,1,2,1,信義路,2019.0,2.0
4,和平東路一段和平大..,4,11,2房2廳1衛,16.0,30000,4900,2019-06-04,52.892562,2,2,1,和平東路,2019.0,6.0

In [190]:
df2 = pd.pivot_table(df, index='road', columns=['year', 'month'], values='price', aggfunc=sum)

In [192]:
#df2

## 資料合併

In [193]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'], 'B': ['B0', 'B1', 'B2', 'B3'],
'C': ['C0', 'C1', 'C2', 'C3'], 'D': ['D0', 'D1', 'D2', 'D3']}, index=[0, 1, 2, 3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'], 'B': ['B4', 'B5', 'B6', 'B7'],
'C': ['C4', 'C5', 'C6', 'C7'], 'D': ['D4', 'D5', 'D6', 'D7']},
index=[4, 5, 6, 7])

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'], 'B': ['B8', 'B9', 'B10', 'B11'],
'C': ['C8', 'C9', 'C10', 'C11'], 'D': ['D8', 'D9', 'D10', 'D11']}, index=[8, 9, 10, 11])

In [194]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [195]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [196]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [197]:
pd.concat([df1, df2, df3], axis = 0)

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [198]:
pd.concat([df1, df2, df3], axis = 1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [201]:
df4 = df1.reset_index(drop='index')
df4

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [202]:
df5 = df2.reset_index(drop='index')
df5

    A   B   C   D
0  A4  B4  C4  D4
1  A5  B5  C5  D5
2  A6  B6  C6  D6
3  A7  B7  C7  D7

In [203]:
df6 = df3.reset_index(drop='index')
df6

     A    B    C    D
0   A8   B8   C8   D8
1   A9   B9   C9   D9
2  A10  B10  C10  D10
3  A11  B11  C11  D11

In [204]:
pd.concat([df4, df5, df6], axis = 1)

    A   B   C   D   A   B   C   D    A    B    C    D
0  A0  B0  C0  D0  A4  B4  C4  D4   A8   B8   C8   D8
1  A1  B1  C1  D1  A5  B5  C5  D5   A9   B9   C9   D9
2  A2  B2  C2  D2  A6  B6  C6  D6  A10  B10  C10  D10
3  A3  B3  C3  D3  A7  B7  C7  D7  A11  B11  C11  D11

In [205]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'], 'A': ['A0', 'A1', 'A2', 'A3'],
'B': ['B0', 'B1', 'B2', 'B3']})

right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'], 'C': ['C0', 'C1', 'C2', 'C3'],
'D': ['D0', 'D1', 'D2', 'D3']})

In [207]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [208]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [210]:
# SELECT * FROM left INNER JOIN right ON left.key = right.key
pd.merge(left, right, on = 'key', how = 'inner')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [211]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'], 'key2': ['K0', 'K1', 'K0', 'K1'],
'A': ['A0', 'A1', 'A2', 'A3'], 'B': ['B0', 'B1', 'B2', 'B3']})
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'], 'key2': ['K0', 'K0', 'K0', 'K0'],
'C': ['C0', 'C1', 'C2', 'C3'], 'D': ['D0', 'D1', 'D2', 'D3']})

In [212]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [213]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [215]:
# SELECT * FROM left INNER JOIN right ON left.key1 = right.key1 AND left.key2 = right.key2
pd.merge(left, right, how = 'inner', on = ['key1', 'key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [216]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'], 'B': ['B0', 'B1', 'B2']},
index=['K0', 'K1', 'K2'])
right = pd.DataFrame({'C': ['C0', 'C2', 'C3'], 'D': ['D0', 'D2', 'D3']},
index=['K0', 'K2', 'K3'])

In [217]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [218]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [219]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

## 資料儲存

In [220]:
import sqlite3 as lite

# 建立連線
con = lite.connect('test.sqlite')

# 建立游標 Cursor
cur = con.cursor()

cur.execute('SELECT SQLITE_VERSION()')

data = cur.fetchone()
print(data)

# 關閉連線
con.cursor()

('3.24.0',)

In [221]:
import sqlite3 as lite

# 建立連線
with lite.connect('test.sqlite') as con:

    # 建立游標 Cursor
    cur = con.cursor()

    cur.execute('SELECT SQLITE_VERSION()')

    data = cur.fetchone()
    print(data)

('3.24.0',)

In [223]:
import sqlite3 as lite
with lite.connect("test.sqlite") as con:
    cur = con.cursor()
    cur.execute("DROP TABLE IF EXISTS PhoneAddress")
    cur.execute("CREATE TABLE PhoneAddress(phone CHAR(10) PRIMARY KEY, address TEXT, name TEXT unique, age INT NOT NULL)")
    cur.execute("INSERT INTO PhoneAddress VALUES('0912173381','United State','Jhon Doe',53)") 
    cur.execute("INSERT INTO PhoneAddress VALUES('0928375018','Tokyo Japan','MuMu Cat',6)") 
    cur.execute("INSERT INTO PhoneAddress VALUES('0957209108','Taipei','Richard',29)") 
    cur.execute("SELECT phone,address FROM PhoneAddress")
    
    data = cur.fetchall()
    print(data)

[('0912173381', 'United State'), ('0928375018', 'Tokyo Japan'), ('0957209108', 'Taipei')]

In [224]:
import sqlite3 as lite
with lite.connect("test.sqlite") as con:
    cur = con.cursor()
    cur.execute("DROP TABLE IF EXISTS PhoneAddress")
    cur.execute("CREATE TABLE PhoneAddress(phone CHAR(10) PRIMARY KEY, address TEXT, name TEXT unique, age INT NOT NULL)")
    cur.execute("INSERT INTO PhoneAddress VALUES('0912173381','United State','Jhon Doe',53)") 
    cur.execute("INSERT INTO PhoneAddress VALUES('0928375018','Tokyo Japan','MuMu Cat',6)") 
    cur.execute("INSERT INTO PhoneAddress VALUES('0957209108','Taipei','Richard',29)") 
    cur.execute("SELECT phone,address FROM PhoneAddress")
    data1 = cur.fetchone()
    print(data1)
    
    data2 = cur.fetchall()
    print(data2)

('0912173381', 'United State')
[('0928375018', 'Tokyo Japan'), ('0957209108', 'Taipei')]

In [225]:
import sqlite3 as lite
import pandas
employee = [{'name':'Mary', 'age':23 , 'gender': 'F'},
            {'name':'John','age':33 , 'gender': 'M'}]
df = pandas.DataFrame(employee)
df

   age gender  name
0   23      F  Mary
1   33      M  John

In [226]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 3 columns):
age       2 non-null int64
gender    2 non-null object
name      2 non-null object
dtypes: int64(1), object(2)
memory usage: 128.0+ bytes

In [227]:
with lite.connect('test.sqlite') as db:
    df.to_sql(name='employee', 
              index=False, 
              con=db,
              if_exists='replace')

In [228]:
with lite.connect('test.sqlite') as db:
    df2 = pd.read_sql_query('SELECT * FROM employee', con = db)
df2

   age gender  name
0   23      F  Mary
1   33      M  John

In [230]:
import pandas as pd
link = 'https://raw.githubusercontent.com/ywchiu/cathaylifepy/master/data/rent591.xlsx' 
df = pd.read_excel(link, index_col=0)
df.head()

,address,floor,allfloor,layout,area,price,browsenum_all,created_date
0,復興南路160巷精華地段雙..,2,15,2房1廳1衛,28.0,"43,800",2180,2019/06/05
1,"臥龍街前眺101後擁山景,..",11,12,3房2廳2衛,69.0,"120,000",1722,2019/06/05
2,光復南路高樓層大巨蛋正對..,10,13,4房2廳2衛,71.3,"130,000",3272,2016/12/14
3,信義路三段台北大安森林公..,12,14,1房2廳1衛,11.0,"36,000",4890,2019/02/26
4,和平東路一段和平大..,4,11,2房2廳1衛,16.0,"30,000",4900,2019/06/04

In [231]:
df['price'] = df['price'].map(lambda e: int(e.replace(',','')))

In [232]:
df[['layout_bedroom','layout_livingroom', 'layout_bathroom']] = df['layout'].str.extract('(\d+)房(\d+)廳(\d+)衛')

In [234]:
del df['layout']

In [236]:
df['created_date'] = pd.to_datetime(df['created_date'], format = '%Y/%m/%d')

In [239]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 772 entries, 0 to 21
Data columns (total 10 columns):
address              772 non-null object
floor                772 non-null int64
allfloor             772 non-null int64
area                 772 non-null float64
price                772 non-null int64
browsenum_all        772 non-null int64
created_date         767 non-null datetime64[ns]
layout_bedroom       766 non-null object
layout_livingroom    766 non-null object
layout_bathroom      766 non-null object
dtypes: datetime64[ns](1), float64(1), int64(4), object(4)
memory usage: 66.3+ KB

In [240]:
with lite.connect('house.sqlite') as db:
    df.to_sql('rent591', con = db, if_exists='replace', index=False)

In [243]:
with lite.connect('house.sqlite') as db:
    df2 = pd.read_sql_query('select * from rent591 order by price desc limit 3', 
                            con = db)
df2

,address,floor,allfloor,area,price,browsenum_all,created_date,layout_bedroom,layout_livingroom,layout_bathroom
0,仁愛路三段成交多戶帝寶找我看..,8,18,210.7,350000,201,2019-05-16 00:00:00,5,2,4
1,瑞安街81巷大陽台全新裝潢近森..,2,13,112.6,280000,65,2019-06-03 00:00:00,4,2,4
2,瑞安街81巷瑞安豪宅❂裝潢、家..,2,13,112.6,280000,262,2018-08-30 00:00:00,4,2,3